{"title":"Baked fish and chips","description":"Baked fish and chips by the Greek chef Akis Petretzikis. A step-by-step recipe for the famous English dish with cod and potatoes in the oven!","servings":4,"prepTime":40,"cookTime":60,"imageUrl":"https://akispetretzikis.com/photos/77445/fish%20and%20chips%20ston%20fourno-site.jpg","instructions":"--- For the yogurt sauce ---\nStep 1: In a small bowl add the yogurt, lemon juice, dill, olive oil, salt, pepper, and mix them with a spoon.\nStep 2: Refrigerate the sauce until needed.\n--- For the cod ---\nStep 3: Spread some paper towels on the bottom of a baking pan and set it aside.\nStep 4: Place the cod on a cutting board.\nStep 5: Use a sharp knife to remove its skin and cut it into small pieces.\nStep 6: Transfer the cod pieces to the baking pan with the paper towels and lightly press them with your hands to remove their excess moisture.\nStep 7: Transfer the cod to a large bowl, add salt and pepper, mix with your hands, and set it aside until needed.\nStep 8: Preheat the oven to 180째C (350째F) set to fan.\nStep 9: In a chopper blender add the bread, garlic, parsley, paprika, oregano, olive oil, salt, pepper, and beat them until the ingredients are homogenized and you get a crust of seasonings.\nStep 10: Transfer the mixture to a small bowl.\nStep 11: Crack the eggs into a third bowl and whisk them with a fork.\nStep 12: Put the flour into a fourth bowl.\nStep 13: Line a baking pan with parchment paper and set it aside.\nStep 14: Dip each cod piece successively into the flour, the eggs, and the seasonings.\nStep 15: Transfer the cod pieces to the baking pan with the parchment paper and bake them in the oven for 15-20 minutes.\n--- For the potatoes ---\nStep 16: Place a pot over medium heat, add the water, vinegar, salt, and bring to a boil.\nStep 17: Peel and cut the potatoes into thin strips that are 1.5x1.5 cm thick.\nStep 18: Add the potatoes into the pot and boil them for 10 minutes.\nStep 19: Increase the oven's temperature to 230째C (450째F) set to fan.\nStep 20: Take a baking pan and set it aside.\nStep 21: Remove the potatoes with a slotted spoon and transfer them to the pan.\nStep 22: Add the olive oil to the pan and mix it well with the potatoes to coat them.\nStep 23: Bake them in the oven for 20 minutes.\nStep 24: Remove the potatoes from the oven, mix them with a spatula, and bake them for another 20 minutes.\nStep 25: Transfer the potatoes to a bowl, add salt, and mix them with the spatula.\n--- To serve ---\nStep 26: Serve the cod with the potatoes and the yogurt sauce, and garnish with lime slices and fresh coriander leaves.","tags":"Akis Petretzikis, Greek","ingredients":"100 g light strained yogurt; 2 tbsp lemon juice; 1 tbsp dill (finely chopped); 1 tbsp olive oil; 1 pinch salt; 1 pinch pepper; 1 kg cod ((fresh or frozen), boneless); 1 pinch salt; 1 pinch pepper; 150 g whole wheat bread; 1 clove(s) of garlic; 2 tbsp parsley; 1 tsp paprika (smoked); 1 tsp oregano; 2 tbsp olive oil; 2 piece eggs (medium); 100 g all-purpose flour; 1 l water; 2 tbsp vinegar; 1 pinch salt; 2 piece potatoes (medium); 5 tbsp olive oil; 1 piece lime(s) (cut into slices); 1 pinch coriander leaves","calories":694,"protein":57,"carbs":46,"fat":30,"fiber":4.2,"sugar":2.9,"sodium":1400,"sourceUrl":"https://akispetretzikis.com/en/recipe/6324/fish-and-chips-ston-foyrno"}
